TOTHTOT/MCU_STM32F103C8x_source/Src/main.c
/**
 ******************************************************************************
 * File Name          : main.c
 * Description        : Main program body
 ******************************************************************************
 ** This notice applies to any and all portions of this file
 * that are not between comment pairs USER CODE BEGIN and
 * USER CODE END. Other portions of this file, whether
 * inserted by the user or by software development tools
 * are owned by their respective copyright owners.
 *
 * COPYRIGHT(c) 2022 STMicroelectronics
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of STMicroelectronics nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************
 */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx_hal.h"
#include "i2c.h"
#include "tim.h"
#include "usart.h"
#include "gpio.h"

/* USER CODE BEGIN Includes */
#include "hal_key.h"
#include "gizwits_product.h"
#include "common.h"
#include "led.h"
#include "delay.h"
#include "dht11.h"
#include "oled.h"
#include "hongwai.h"
#include "stmflash.h"

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
#define GPIO_KEY_NUM 2                ///< Defines the total number of key member
keyTypedef_t singleKey[GPIO_KEY_NUM]; ///< Defines a single key member array pointer
keysTypedef_t keys;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_NVIC_Init(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */
uint8_t buf[1024];
const uint8_t TEXT_Buffer[] = {"STM32 FLASH TEST"};
#define SIZE_BUF sizeof(TEXT_Buffer) //数组长度
#define FLASH_SAVE_ADDR 0X08009000   //设置FLASH 保存地址(必须为偶数，且其值要大于本代码所占用FLASH的大小+0X08000000)

/* USER CODE END 0 */

int main(void)
{

    /* USER CODE BEGIN 1 */
    uint16_t loop_times = 0, tt1 = 0;

    char hw_buf[1024];
    /* USER CODE END 1 */

    /* MCU Configuration----------------------------------------------------------*/

    /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
    HAL_Init();

    /* USER CODE BEGIN Init */

    /* USER CODE END Init */

    /* Configure the system clock */
    SystemClock_Config();

    /* USER CODE BEGIN SysInit */

    /* USER CODE END SysInit */

    /* Initialize all configured peripherals */
    MX_GPIO_Init();
    MX_TIM2_Init();
    MX_USART1_UART_Init();
    MX_USART2_UART_Init();
    MX_USART3_UART_Init();
    MX_I2C1_Init();

    /* Initialize interrupts */
    MX_NVIC_Init();

    /* USER CODE BEGIN 2 */
    delay_init(72);
    timerInit();
    uartInit();
    userInit();
    gizwitsInit();
    GIZWITS_LOG("MCU Init Success \n");
    OLED_Init();
    OLED_Clear();
    OLED_ShowString(0, 0, "check dht11...", 16);
    DHT11_Init();
    OLED_Clear();
    OLED_ShowString(0, 0, "check onilne  ", 16);
    delay_ms(300);
    main_page();
    /* USER CODE END 2 */
    gizwitsHandle((dataPoint_t *)&currentDataPoint); //数据上报
    gizwitsHandle((dataPoint_t *)&currentDataPoint); //数据上报
    /* Infinite loop */
    /* USER CODE BEGIN WHILE */
    while (1)
    {
        /* USER CODE END WHILE */

        /* USER CODE BEGIN 3 */
        if (loop_times % 50 == 0)
        {
            // u3_printf("11%d\r\n", 1);
            DHT11_Read_Data(&currentDataPoint.valuewendu, &currentDataPoint.valueshidu);

            gizwitsHandle((dataPoint_t *)&currentDataPoint); //数据上报
            main_page_data();
            // uartWrite("111\r\n", 5);
        }
        if (loop_times % 100 == 0)
        {
            // u3_printf("asdasdads\r\n");
            // HW_Send_Data("1234\r\n",6);
            LED0_TOGGLE; //每500ms led 闪烁一次
            // printf("温度:%d,湿度:%d\r\n", currentDataPoint.valuewendu, currentDataPoint.valueshidu);
            loop_times = 0;
        }
        userHandle();

        loop_times++;
        if (usart_send_state != DIS_USEND)
        {
            switch (usart_send_state)
            {
            case EN_U1SEND:
                // LED0_TOGGLE;
                printf("data:%s", USART1_RX_BUF);
#if 0
                if (strcmp((char *)USART1_RX_BUF, "111") == 0)
                {
                    // printf("send data\r\n");
                    HW_Send_Data((uint8_t *)buf, IR_Learn_Pack(buf, 0));
                }
                else if (strcmp((char *)USART1_RX_BUF, "222") == 0)
                {
                    HW_Send_Data((uint8_t *)buf, IR_Send_Pack(buf, 0));
                }
                else if (strcmp((char *)USART1_RX_BUF, "333") == 0)
                {
                    HW_Send_Data((char *)inside_exit_learn_code, 9);
                }
                // u3_printf("data:%s\r\n",inside_learn_code[0][0]);
#endif
                if (strcmp((char *)USART1_RX_BUF, "soft") == 0)
                {
                    printf("\r\nairlink:%d\r\n", gizwitsSetMode(WIFI_SOFTAP_MODE));
                }
                else if (strcmp((char *)USART1_RX_BUF, "airlink") == 0)
                {
                    printf("\r\nairlink:%d\r\n", gizwitsSetMode(WIFI_AIRLINK_MODE));
                }
                else if (strcmp((char *)USART1_RX_BUF, "hw_output_0") == 0)
                {
                    HW_Send_Data((uint8_t *)hw_buf, IR_Read_Pack((uint8_t *)hw_buf, 0));
                }
                else if (strcmp((char *)USART1_RX_BUF, "hw_output_1") == 0)
                {
                    HW_Send_Data((uint8_t *)hw_buf, IR_Read_Pack((uint8_t *)hw_buf, 1));
                }
                else if (strcmp((char *)USART1_RX_BUF, "hw_output_2") == 0)
                {
                    HW_Send_Data((uint8_t *)hw_buf, IR_Read_Pack((uint8_t *)hw_buf, 2));
                }
                else if (strcmp((char *)USART1_RX_BUF, "hw_output_3") == 0)
                {
                    HW_Send_Data((uint8_t *)hw_buf, IR_Read_Pack((uint8_t *)hw_buf, 3));
                }
                else if (strcmp((char *)USART1_RX_BUF, "hw_output_4") == 0)
                {
                    HW_Send_Data((uint8_t *)hw_buf, IR_Read_Pack((uint8_t *)hw_buf, 4));
                }
                else if (strcmp((char *)USART1_RX_BUF, "hw_output_5") == 0)
                {
                    HW_Send_Data((uint8_t *)hw_buf, IR_Read_Pack((uint8_t *)hw_buf, 5));
                }
                else if (strcmp((char *)USART1_RX_BUF, "hw_output_6") == 0)
                {
                    HW_Send_Data((uint8_t *)hw_buf, IR_Read_Pack((uint8_t *)hw_buf, 6));
                }
                else if (strcmp((char *)USART1_RX_BUF, "learn_poweron") == 0)
                {
                    HW_Send_Data((uint8_t *)hw_buf, IR_Learn_Outer_Pack((uint8_t *)hw_buf));
                    KT_run_state.learn_outer = learn_on;
                }
                else if (strcmp((char *)USART1_RX_BUF, "learn_poweroff") == 0)
                {
                    HW_Send_Data((uint8_t *)hw_buf, IR_Learn_Outer_Pack((uint8_t *)hw_buf));
                    KT_run_state.learn_outer = learn_off;
                }
                else if (strcmp((char *)USART1_RX_BUF, "send_poweron") == 0)
                {
                    STMFLASH_Read(KT_POWER_ON_FLASH_ADDR, &tt1, 2); // 读取长度
                    STMFLASH_Read(KT_POWER_ON_FLASH_ADDR + 2, (uint16_t *)hw_buf, tt1);

                    // u3_printf("\r\nbuflen:%d\r\n", tt1);
                    HW_Send_Data((uint8_t *)hw_buf, tt1);
                    memset(hw_buf, 0, sizeof(hw_buf));
                }
                else if (strcmp((char *)USART1_RX_BUF, "send_poweroff") == 0)
                {
                    STMFLASH_Read(KT_POWER_OFF_FLASH_ADDR, (uint16_t *)hw_buf, 256);
                    printf("\r\nbuf:%s\r\n", hw_buf);
                    memset(hw_buf, 0, sizeof(hw_buf));
                }
                USART1_RX_STA = 0;
                memset(USART1_RX_BUF, 0, sizeof(USART1_RX_BUF));
                usart_send_state = DIS_USEND;
                break;
            case EN_U2SEND:
                usart_send_state = DIS_USEND;
                break;
            case EN_U3SEND:
                usart_send_state = DIS_USEND;
                break;
            case 4:
                printf("no compelite\r\n");
                usart_send_state = DIS_USEND;
                break;
            default:
                break;
            }
        }
        delay_ms(5);
    }
    /* USER CODE END 3 */
}

