TOTHTOT/MCU_STM32F103C8x_source/Src/main.c
/** System Clock Configuration
 */
void SystemClock_Config(void)
{

    RCC_OscInitTypeDef RCC_OscInitStruct;
    RCC_ClkInitTypeDef RCC_ClkInitStruct;

    /**Initializes the CPU, AHB and APB busses clocks
     */
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSEState = RCC_HSE_ON;
    RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
    RCC_OscInitStruct.HSIState = RCC_HSI_ON;
    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
    RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;
    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
    {
        _Error_Handler(__FILE__, __LINE__);
    }

    /**Initializes the CPU, AHB and APB busses clocks
     */
    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
    {
        _Error_Handler(__FILE__, __LINE__);
    }

    /**Configure the Systick interrupt time
     */
    HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq() / 1000);

    /**Configure the Systick
     */
    HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

    /* SysTick_IRQn interrupt configuration */
    HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/** NVIC Configuration
 */
static void MX_NVIC_Init(void)
{
    /* TIM2_IRQn interrupt configuration */
    HAL_NVIC_SetPriority(TIM2_IRQn, 1, 0);
    HAL_NVIC_EnableIRQ(TIM2_IRQn);
    /* USART2_IRQn interrupt configuration */
    HAL_NVIC_SetPriority(USART2_IRQn, 6, 0);
    HAL_NVIC_EnableIRQ(USART2_IRQn);
}

/* USER CODE BEGIN 4 */
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
    //  uint16_t buf_len;
    uint8_t hw_index;
    char t_t = 0; // 温差
    uint16_t tt1 = 0;
    // static u8 fs_flag = 0, mod_flag = 0, power_flag = 0, fs_dfault_flag = 1, mod_dfault_flag = 1;
    /* 按下"学习"按钮进入学习模式,按如下顺序学习:
    1.进入学习模式OLED显示"Learning"
    2.按下"温度增加"红外模块绿灯亮起,空调遥控器调整到19度然后对准孔外接收管,按下对应按键,
    红外模块LED熄灭表示学习完成,重复 10 次记录10个温度数据;
    3.按下"风速", 学习 一档风速 绿色LED亮起,接收到有效红外信息后熄灭,
    之后再按一次风速学习 二档风速 ,
    最后再按一次风速学习 三档风速;
    4.按下"模式", 同上操作,但只需按两次;
    5.按下"开机",同上操作,但只需按两次;
    6.在完成学习后再次按下学习按钮退出学习模式.
     */
    switch (GPIO_Pin)
    {
    case wd_up_Pin:
        delay_ms(10);
        if (HAL_GPIO_ReadPin(wd_up_GPIO_Port, wd_up_Pin) == 0)
        {
            printf("1 wendu:%d,%d\r\n",KT_run_state.kt_temp, currentDataPoint.valuewemdu_kongzhi);
            if (KT_run_state.run_mode == default_mode) //默认工作模式
            {
                hw_index = 0;
                KT_run_state.kt_temp++;
                if (KT_run_state.kt_temp > KT_TEMP_MAX)
                {
                    KT_run_state.kt_temp = KT_TEMP_MAX;
                }
                currentDataPoint.valuewemdu_kongzhi = KT_run_state.kt_temp; // 同步到云端
                t_t = KT_run_state.kt_temp - KT_TEMP_MIN;

                // 增加温度
                STMFLASH_Read(KT_TEMP_20_FLASH_ADDR + (KT_TEMP_ADDER_INCREASE * t_t), &tt1, 2); // 读取长度
                if (tt1 > KT_READ_MAX_LENTH)
                {
                    OLED_Clear();
                    OLED_ShowString(0, 0, "Error:read lenth to big!!", 8);
                    tt1 = 512;
                }
                STMFLASH_Read(KT_TEMP_20_FLASH_ADDR + (KT_TEMP_ADDER_INCREASE * t_t) + 2, (uint16_t *)buf, tt1);

                printf("\r\n***************buflen:%d***************\r\n", tt1);
                HW_Send_Data((uint8_t *)buf, tt1);
                memset(buf, 0, sizeof(buf));
            }
            else if (KT_run_state.run_mode == learn_mode) //学习模式,按下开始学习遥控器,从二十度开始学习
            {
                hw_index = 0;
                printf("学习增温\r\n");
                HW_Send_Data((uint8_t *)buf, IR_Learn_Outer_Pack((uint8_t *)buf));
                KT_run_state.learn_outer = learn_temp;
                KT_run_state.learn_temp_flag++;
                if (KT_run_state.learn_temp_flag > KT_TEMP_DATA_NUM)
                {
                    KT_run_state.learn_temp_flag = KT_TEMP_DATA_NUM;
                }
            }
        }
        break;
    case wd_down_Pin:
        delay_ms(10);
        if (HAL_GPIO_ReadPin(wd_down_GPIO_Port, wd_down_Pin) == 0)
        {
            printf("2 wendu:%d,%d\r\n",KT_run_state.kt_temp, currentDataPoint.valuewemdu_kongzhi);
            if (KT_run_state.run_mode == default_mode) //默认工作模式
            {
                hw_index = 1;
                KT_run_state.kt_temp--;
                if (KT_run_state.kt_temp < KT_TEMP_MIN)
                {
                    printf("1212\r\n");
                    KT_run_state.kt_temp = KT_TEMP_MIN;
                }
                currentDataPoint.valuewemdu_kongzhi = KT_run_state.kt_temp; // 同步到云端
                t_t = KT_run_state.kt_temp - KT_TEMP_MIN;

                // 增加温度
                STMFLASH_Read(KT_TEMP_20_FLASH_ADDR + (KT_TEMP_ADDER_INCREASE * t_t), &tt1, 2); // 读取长度
                if (tt1 > KT_READ_MAX_LENTH)
                {
                    OLED_Clear();
                    OLED_ShowString(0, 0, "Error:read lenth to big!!", 8);
                    tt1 = 512;
                }
                STMFLASH_Read(KT_TEMP_20_FLASH_ADDR + (KT_TEMP_ADDER_INCREASE * t_t) + 2, (uint16_t *)buf, tt1);

                printf("\r\n***************buflen:%d***************\r\n", tt1);
                HW_Send_Data((uint8_t *)buf, tt1);
                memset(buf, 0, sizeof(buf));
            }
            else if (KT_run_state.run_mode == learn_mode) //学习模式,按下开始学习遥控器
            {
                // hw_index = 1;
                printf("学习降温(没用)\r\n");
                // HW_Send_Data((uint8_t *)buf, IR_Learn_Pack(buf, hw_index));
            }
        }
        break;
    case ch_fs_Pin:
        delay_ms(10);
        if (HAL_GPIO_ReadPin(ch_fs_GPIO_Port, ch_fs_Pin) == 0)
        {
            if (KT_run_state.run_mode == default_mode) //默认工作模式
            {
                if (KT_run_state.fs_dfault_flag == 0) //等于0 发送一档风速
                {
                    hw_index = 2;
                    KT_run_state.fs_dfault_flag = 1;
                    KT_run_state.windspeed = low;
                    currentDataPoint.valuewindspeed = 0;
                    HW_Send_Data((uint8_t *)buf, IR_Send_Pack(buf, hw_index));
                }
                else if (KT_run_state.fs_dfault_flag == 1) //等于1 发送二档风速
                {
                    hw_index = 3;
                    KT_run_state.fs_dfault_flag = 2;
                    KT_run_state.windspeed = mid;
                    currentDataPoint.valuewindspeed = 1;
                    HW_Send_Data((uint8_t *)buf, IR_Send_Pack(buf, hw_index));
                }
                else if (KT_run_state.fs_dfault_flag == 2) //等于2 发送三档风速
                {
                    hw_index = 4;
                    KT_run_state.fs_dfault_flag = 0;
                    KT_run_state.windspeed = high;
                    currentDataPoint.valuewindspeed = 2;
                    HW_Send_Data((uint8_t *)buf, IR_Send_Pack(buf, hw_index));
                }
            }
            else if (KT_run_state.run_mode == learn_mode) //学习模式,按下开始学习遥控器
            {
                if (KT_run_state.fs_flag == 0) // 等于0 学习一档风速
                {
                    hw_index = 2;
                    KT_run_state.fs_flag = 1;
                    printf("学习一档风速\r\n");
                    HW_Send_Data((uint8_t *)buf, IR_Learn_Pack(buf, hw_index));
                }
                else if (KT_run_state.fs_flag == 1) // 等于1 学习二档风速
                {
                    hw_index = 3;
                    KT_run_state.fs_flag = 2;
                    printf("学习二档风速\r\n");
                    HW_Send_Data((uint8_t *)buf, IR_Learn_Pack(buf, hw_index));
                }
                else if (KT_run_state.fs_flag == 2) // 等于2 学习三档风速
                {
                    hw_index = 4;
                    KT_run_state.fs_flag = 0;
                    printf("学习三档风速\r\n");
                    HW_Send_Data((uint8_t *)buf, IR_Learn_Pack(buf, hw_index));
                }
            }
        }
        break;
    case ch_mod_Pin:
        delay_ms(10);
        if (HAL_GPIO_ReadPin(ch_mod_GPIO_Port, ch_mod_Pin) == 0)
        {
            if (KT_run_state.run_mode == default_mode) //默认工作模式
            {
                if (KT_run_state.mod_dfault_flag == 0)
                {
                    hw_index = 5;
                    KT_run_state.workmod = cool;
                    currentDataPoint.valuework_mod = 0;
                    HW_Send_Data((uint8_t *)buf, IR_Send_Pack(buf, hw_index));
                    KT_run_state.mod_dfault_flag = 1;
                }
                else if (KT_run_state.mod_dfault_flag == 1)
                {
                    hw_index = 6;
                    currentDataPoint.valuework_mod = 1;
                    HW_Send_Data((uint8_t *)buf, IR_Send_Pack(buf, hw_index));
                    KT_run_state.mod_dfault_flag = 0;
                }
            }
            else if (KT_run_state.run_mode == learn_mode) //学习模式,按下开始学习遥控器
            {
                if (KT_run_state.mod_flag == 0) // 等于0 学习制冷模式
                {
                    hw_index = 5;
                    KT_run_state.mod_flag = 1;
                    printf("学习制冷\r\n");
                    HW_Send_Data((uint8_t *)buf, IR_Learn_Pack(buf, hw_index));
                }
                else if (KT_run_state.mod_flag == 1) // 等于1 学习制暖模式
                {
                    hw_index = 6;
                    KT_run_state.mod_flag = 0;
                    printf("学习制暖\r\n");
                    HW_Send_Data((uint8_t *)buf, IR_Learn_Pack(buf, hw_index));
                }
            }
        }
        break;
    case kt_power_Pin:
        delay_ms(10);
        if (HAL_GPIO_ReadPin(kt_power_GPIO_Port, kt_power_Pin) == 0)
        {
            printf("power key press\r\n");
            if (KT_run_state.run_mode == default_mode) // 默认模式
            {
                if (KT_run_state.kt_power == 0)
                {
                    // 开机
                    STMFLASH_Read(KT_POWER_ON_FLASH_ADDR, &tt1, 2); // 读取长度
                    if (tt1 > KT_READ_MAX_LENTH)
                    {
                        OLED_Clear();
                        OLED_ShowString(0, 0, "Error:read lenth to big!!", 8);
                        tt1 = 512;
                    }
                    STMFLASH_Read(KT_POWER_ON_FLASH_ADDR + 2, (uint16_t *)buf, tt1);

                    printf("\r\n***************buflen:%d***************\r\n", tt1);
                    HW_Send_Data((uint8_t *)buf, tt1);
                    memset(buf, 0, sizeof(buf));
                    currentDataPoint.valuepower = 1;
                    KT_run_state.kt_power = 1;
                }
                else if (KT_run_state.kt_power == 1)
                {
                    // 关机
                    STMFLASH_Read(KT_POWER_OFF_FLASH_ADDR, &tt1, 2); // 读取长度
                    if (tt1 > KT_READ_MAX_LENTH)
                    {
                        OLED_Clear();
                        OLED_ShowString(0, 0, "Error:read lenth to big!!", 8);
                        tt1 = 512;
                    }
                    printf("\r\n***************buflen:%d***************\r\n", tt1);
                    STMFLASH_Read(KT_POWER_OFF_FLASH_ADDR + 2, (uint16_t *)buf, tt1);

                    HW_Send_Data((uint8_t *)buf, tt1);
                    memset(buf, 0, sizeof(buf));
                    currentDataPoint.valuepower = 0;
                    KT_run_state.kt_power = 0;
                    KT_run_state.kt_power = 0;
                    currentDataPoint.valuepower = 0;
                }
            }
            else if (KT_run_state.run_mode == learn_mode)
            {
                if (KT_run_state.power_flag == 0) // 学习开机
                {
                    printf("学习开机\r\n");
                    HW_Send_Data((uint8_t *)buf, IR_Learn_Outer_Pack((uint8_t *)buf));
                    KT_run_state.learn_outer = learn_on;
                    KT_run_state.power_flag = 1;
                }
                else if (KT_run_state.power_flag == 1)
                {
                    printf("学习关机\r\n");
                    HW_Send_Data((uint8_t *)buf, IR_Learn_Outer_Pack((uint8_t *)buf));
                    KT_run_state.learn_outer = learn_off;
                    KT_run_state.power_flag = 0;
                }
            }
        }
        break;
    case learn_bt_Pin:
        delay_ms(10);
        if (HAL_GPIO_ReadPin(learn_bt_GPIO_Port, learn_bt_Pin) == 0)
        {
            if (KT_run_state.run_mode == default_mode)
            {
                // KT_run_state.learn_outer = 1;
                KT_run_state.run_mode = learn_mode;
                printf("学习模式\r\n");
            }
            else if (KT_run_state.run_mode == learn_mode)
            {
                KT_run_state.run_mode = default_mode;
                HW_Send_Data(inside_exit_learn_code, 8);
                printf("默认模式\r\n");
            }
            // main_page_data();
        }
        break;
    default:
        break;
    }
}
/* USER CODE END 4 */

/**
 * @brief  This function is executed in case of error occurrence.
 * @param  None
 * @retval None
 */
void _Error_Handler(char *file, int line)
{
    /* USER CODE BEGIN Error_Handler_Debug */
    /* User can add his own implementation to report the HAL error return state */
    while (1)
    {
    }
    /* USER CODE END Error_Handler_Debug */
}

#ifdef USE_FULL_ASSERT

/**
 * @brief Reports the name of the source file and the source line number
 * where the assert_param error has occurred.
 * @param file: pointer to the source file name
 * @param line: assert_param error line source number
 * @retval None
 */
void assert_failed(uint8_t *file, uint32_t line)
{
    /* USER CODE BEGIN 6 */
    /* User can add his own implementation to report the file name and line number,
      ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
    /* USER CODE END 6 */
}

#endif

/**
 * @}
 */

/**
 * @}
 */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
